src/main/resources/xml/accommodationBatchComponentWSPort/stageMassReinstateTransactional/stageMassReinstateTransactional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bat="http://batch.accommodation.services.booking.dreams.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <bat:stageMassReinstateTransactional>
         <!--Optional:-->
         <request>
            <!--Optional:-->
            <processName>?</processName>
            <!--Zero or more repetitions:-->
            <massReinstateRequestDetail>
               <!--Optional:-->
               <processDetailId>?</processDetailId>
               <!--Optional:-->
               <reInstateWithPrice>?</reInstateWithPrice>
               <!--Optional:-->
               <reInstateContactName>?</reInstateContactName>
               <!--Optional:-->
               <reInstateReason>?</reInstateReason>
               <!--Optional:-->
               <isFeeWaived>?</isFeeWaived>
               <!--Optional:-->
               <travelComponentGroupingId>?</travelComponentGroupingId>
               <!--Optional:-->
               <travelPlanId>?</travelPlanId>
            </massReinstateRequestDetail>
         </request>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </bat:stageMassReinstateTransactional>
   </soapenv:Body>
</soapenv:Envelope>